Revit 2026 API

# ParameterDownloadOptionsSetCategories Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetCategories(
	ISet<ElementId> categories
)
```
```vb
Public Sub SetCategories (
	categories As ISet(Of ElementId)
)
```
```cpp
public:
void SetCategories(
	ISet<ElementId^>^ categories
)
```
```fsharp
member SetCategories :
        categories : ISet<ElementId> -> unit
```

#### Parameters

categories ISetElementId

#### Reference

ParameterDownloadOptions Class

Autodesk.Revit.DB Namespace